TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/dma_fill_data/dma_fill_data.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0L111X" --package "LQFP-48(PT)" --part "Default"
//@v2CliArgs --device "MSPM0L1117" --package "LQFP-48(PT)"
// @cliArgs --board /ti/boards/LP_MSPM0L1117 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const DMA = scripting.addModule("/ti/driverlib/DMA");
const GPIO   = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1  = GPIO.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
DMA.associatedChannels.create(1);
DMA.associatedChannels[0].$name           = "DMA_CH0";
DMA.associatedChannels[0].transferMode    = "SINGLE_BLOCK";
DMA.associatedChannels[0].dstIncDec       = "INCREMENT";
DMA.associatedChannels[0].srcLength       = "WORD";
DMA.associatedChannels[0].addressMode     = "fill";
DMA.associatedChannels[0].fillIncAmount   = "BYTE";
DMA.associatedChannels[0].enableInterrupt = true;
DMA.associatedChannels[0].peripheral.$assign = "DMA_CH0";

GPIO1.$name                          = "GPIO_LEDS";
GPIO1.associatedPins.create(2);
GPIO1.associatedPins[0].$name        = "USER_LED_1";
GPIO1.associatedPins[0].initialValue = "SET";
GPIO1.associatedPins[0].pin.$assign  = "PA0";
GPIO1.associatedPins[1].$name        = "USER_TEST";
GPIO1.associatedPins[1].initialValue = "SET";
GPIO1.associatedPins[1].pin.$assign  = "PA25";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL", {}, false);


SYSCTL.clockTreeEn  = true;
